app/Controllers/Comments.php

SELECT *
FROM `comments`
WHERE `id` = 12
SELECT *
FROM `comments`
WHERE `published` > 0
SELECT *
FROM `users`
WHERE `id` = '4'
 LIMIT 1
SELECT *
FROM `posts`
WHERE `id` = '330'
 LIMIT 1
---
   public function compile($id=0)
   {
      $CommentsModel = new CommentsModel();

      if ($id > 0)
      {
         $comments = $CommentsModel->where('id', $id)->find();
      }
      else
      {
         $comments = $CommentsModel->where('published >', 0)->findAll();
      }
  $dataz=[];
  $UsersModel = new UsersModel();
  $postModel = new PostsModel();
  if(count($comments) > 0){
   foreach($comments as $val){
      $id=$val['id'];
      $user_id=$val['user_id'];
      $user=$UsersModel ->where('id',$user_id)->first();

        $post_id=$val['post_id'];
      $post=$postModel ->where('id',$post_id)->first();