app/Controllers/Posts.php

   public function index()
   {
      $PostsModel = new PostsModel();

      $date = date("Y-m-d");
      $dataz = $PostsModel->like('published_at', $date)->find();
---
SELECT *
FROM `posts`
WHERE `published_at` LIKE '%2023-02-09%' ESCAPE '!'

   public function get_posts(){

      //initialize model objects
      $PostsModel = new PostsModel();
      $CommentsModel = new CommentsModel();

      //getting todays date
      $date = date("Y-m-d");

      //Creating an empty array
      $result=[];

      //calling all posts of todays date
      $dataz = $PostsModel->like('published_at', $date)->find();

      //Looping through all posts received
      foreach($dataz as $val){

         //getting id from each post
         $id= $val['id'];

         //using post id from above, going to comments to get records if available
         $comments = $CommentsModel->where('post_id', $id)->findAll();
---
SELECT *
FROM `posts`
WHERE `published_at` LIKE '%2023-02-09%' ESCAPE '!'
SELECT *
FROM `comments`
WHERE `post_id` = '308'